import { IPost } from '~/modules/post/interface/IPost';

export default [
  {
    'id': 0,
    'title': '「全港大罷工」爆流血衝突 首度出動裝甲車',
    'excerpt': '香港在昨天發起全港大罷工，港警深夜清場再度爆發流血衝突，警方也首度出動裝甲車。對於特首林鄭月娥還是沒有正面回應五大訴求，以及財政司長指出反送中風波削弱外商的投資意願，讓示威者質疑是抹黑，今天罕見舉行記者會回擊。至於媒體關心，如果中共派出解放軍鎮壓該怎麼辦？',
    'category': '港澳',
    'createdAt': '2009-08-06T13:45:30',
    'isPopular': true,
    'editing': false,
    'editCount': 89
  },
  {
    'id': 1,
    'title': '「全港大罷工」爆流血衝突 首度出動裝甲車',
    'excerpt': '香港在昨天發起全港大罷工，港警深夜清場再度爆發流血衝突，警方也首度出動裝甲車。對於特首林鄭月娥還是沒有正面回應五大訴求，以及財政司長指出反送中風波削弱外商的投資意願，讓示威者質疑是抹黑，今天罕見舉行記者會回擊。至於媒體關心，如果中共派出解放軍鎮壓該怎麼辦？',
    'category': '港澳',
    'createdAt': '2009-08-06T13:45:30',
    'isPopular': true,
    'editing': false,
    'editCount': 89
  },
  {
    'id': 2,
    'title': '「全港大罷工」爆流血衝突 首度出動裝甲車',
    'excerpt': '香港在昨天發起全港大罷工，港警深夜清場再度爆發流血衝突，警方也首度出動裝甲車。對於特首林鄭月娥還是沒有正面回應五大訴求，以及財政司長指出反送中風波削弱外商的投資意願，讓示威者質疑是抹黑，今天罕見舉行記者會回擊。至於媒體關心，如果中共派出解放軍鎮壓該怎麼辦？',
    'category': '港澳',
    'createdAt': '2009-08-06T13:45:30',
    'isPopular': true,
    'editing': false,
    'editCount': 89
  },
  {
    'id': 3,
    'title': '「全港大罷工」爆流血衝突 首度出動裝甲車',
    'excerpt': '香港在昨天發起全港大罷工，港警深夜清場再度爆發流血衝突，警方也首度出動裝甲車。對於特首林鄭月娥還是沒有正面回應五大訴求，以及財政司長指出反送中風波削弱外商的投資意願，讓示威者質疑是抹黑，今天罕見舉行記者會回擊。至於媒體關心，如果中共派出解放軍鎮壓該怎麼辦？',
    'category': '港澳',
    'createdAt': '2009-08-06T13:45:30',
    'isPopular': true,
    'editing': true,
    'editCount': 89
  },
  {
    'id': 4,
    'title': '「全港大罷工」爆流血衝突 首度出動裝甲車',
    'excerpt': '香港在昨天發起全港大罷工，港警深夜清場再度爆發流血衝突，警方也首度出動裝甲車。對於特首林鄭月娥還是沒有正面回應五大訴求，以及財政司長指出反送中風波削弱外商的投資意願，讓示威者質疑是抹黑，今天罕見舉行記者會回擊。至於媒體關心，如果中共派出解放軍鎮壓該怎麼辦？',
    'category': '港澳',
    'createdAt': '2009-08-06T13:45:30',
    'isPopular': true,
    'editing': true,
    'editCount': 89
  },
  {
    'id': 5,
    'title': '「全港大罷工」爆流血衝突 首度出動裝甲車',
    'excerpt': '香港在昨天發起全港大罷工，港警深夜清場再度爆發流血衝突，警方也首度出動裝甲車。對於特首林鄭月娥還是沒有正面回應五大訴求，以及財政司長指出反送中風波削弱外商的投資意願，讓示威者質疑是抹黑，今天罕見舉行記者會回擊。至於媒體關心，如果中共派出解放軍鎮壓該怎麼辦？',
    'category': '港澳',
    'createdAt': '2009-08-06T13:45:30',
    'isPopular': true,
    'editing': true,
    'editCount': 89
  }
] as IPost[];
